In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

#importing necessary libraries for this analysis

Matplotlib is building the font cache; this may take a moment.

In [3]:
#loading our dataset into this workbook
Sd= pd.read_csv(r'C:\Users\USER\Customer-segmentation\segmentation_data.csv')

In [5]:
Sd

,ID,Sex,Marital status,Age,Education,Income,Occupation,Settlement size
0,100000001,0,0,67,2,124670,1,2
1,100000002,1,1,22,1,150773,1,2
2,100000003,0,0,49,1,89210,0,0
3,100000004,0,0,45,1,171565,1,1
4,100000005,0,0,53,1,149031,1,1
...,...,...,...,...,...,...,...,...
1995,100001996,1,0,47,1,123525,0,0
1996,100001997,1,1,27,1,117744,1,0
1997,100001998,0,0,31,0,86400,0,0
1998,100001999,1,1,24,1,97968,0,0
1999,100002000,0,0,25,0,68416,0,0

### Cleaning the Data
Handling outliers, missing values and any inconsistencies in the dataset.

In [9]:
#Checking our dataset for any missing values
print(Sd.isnull().sum())

ID                 0
Sex                0
Marital status     0
Age                0
Education          0
Income             0
Occupation         0
Settlement size    0
dtype: int64

### Exploratory Data Analysis
Understanding the structure of the data and visualising important features.

In [7]:
#summary statistics of the dataset
print(Sd.describe())

                 ID          Sex  Marital status          Age   Education  \
count  2.000000e+03  2000.000000     2000.000000  2000.000000  2000.00000
mean   1.000010e+08     0.457000        0.496500    35.909000     1.03800
std    5.774946e+02     0.498272        0.500113    11.719402     0.59978
min    1.000000e+08     0.000000        0.000000    18.000000     0.00000
25%    1.000005e+08     0.000000        0.000000    27.000000     1.00000
50%    1.000010e+08     0.000000        0.000000    33.000000     1.00000
75%    1.000015e+08     1.000000        1.000000    42.000000     1.00000
max    1.000020e+08     1.000000        1.000000    76.000000     3.00000

              Income   Occupation  Settlement size
count    2000.000000  2000.000000      2000.000000
mean   120954.419000     0.810500         0.739000
std     38108.824679     0.638587         0.812533
min     35832.000000     0.000000         0.000000
25%     97663.250000     0.000000         0.000000
50%    115548.500000     1.000000         1.000000
75%    138072.250000     1.000000         1.000000
max    309364.000000     2.000000         2.000000

In [8]:
#structure of the dataset
print(Sd.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2000 non-null   int64
 1   Sex              2000 non-null   int64
 2   Marital status   2000 non-null   int64
 3   Age              2000 non-null   int64
 4   Education        2000 non-null   int64
 5   Income           2000 non-null   int64
 6   Occupation       2000 non-null   int64
 7   Settlement size  2000 non-null   int64
dtypes: int64(8)
memory usage: 125.1 KB
None